flow-around-rectangular-cylinder/flow_around_cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (0.03 0 0);
    }

    outlet
    {
        type zeroGradient;
    }

    wall
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    obstacle
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }
    frontAndBack
    {
        type    empty;
    }

}


// ************************************************************************* //
